import React from "react";
import Navbar from "./components/layout/Navbar";
import Hero from "./components/sections/Hero";
import { useEffect, useRef } from "react";
import About from "./components/sections/About";
import Skills from "./components/sections/Skills";
import Projects from "./components/sections/Projects";
import Services from "./components/sections/Services";
import Testimonials from "./components/sections/Testimonials";
import Contact from "./components/sections/Contact";
import Footer from "./components/layout/Footer";

function App() {
  const hasLogged = useRef(false);

  useEffect(() => {
    if (!hasLogged.current) {
      const asciiArt = `
 █████╗ ██████╗ ██████╗ ███████╗██╗     ██████╗  █████╗ ██╗  ██╗███╗   ███╗ █████╗ ███╗   ██╗
██╔══██╗██╔══██╗██╔══██╗██╔════╝██║     ██╔══██╗██╔══██╗██║  ██║████╗ ████║██╔══██╗████╗  ██║
███████║██████╔╝██║  ██║█████╗  ██║     ██████╔╝███████║███████║██╔████╔██║███████║██╔██╗ ██║
██╔══██║██╔══██╗██║  ██║██╔══╝  ██║     ██╔══██╗██╔══██║██╔══██║██║╚██╔╝██║██╔══██║██║╚██╗██║
██║  ██║██████╔╝██████╔╝███████╗███████╗██║  ██║██║  ██║██║  ██║██║ ╚═╝ ██║██║  ██║██║ ╚████║
╚═╝  ╚═╝╚═════╝ ╚═════╝ ╚══════╝╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝

███╗   ███╗ █████╗ ██╗  ██╗███╗   ███╗ ██████╗ ██╗   ██╗██████╗ 
████╗ ████║██╔══██╗██║  ██║████╗ ████║██╔═══██╗██║   ██║██╔══██╗
██╔████╔██║███████║███████║██╔████╔██║██║   ██║██║   ██║██║  ██║
██║╚██╔╝██║██╔══██║██╔══██║██║╚██╔╝██║██║   ██║██║   ██║██║  ██║
██║ ╚═╝ ██║██║  ██║██║  ██║██║ ╚═╝ ██║╚██████╔╝╚██████╔╝██████╔╝
╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝ ╚═════╝ ╚═════╝ ╚═════╝ 
      `;

      console.log(
        `%c${asciiArt}%c\n👤 Abdelrahman Mahmoud - Suez, Egypt\n`,
        "color: #8dff69; font-weight: bold; font-family: monospace; font-size: 10px;",
        "color: #ffffff; font-weight: bold; font-style: italic;"
      );

      hasLogged.current = true;
    }
  }, []);

  return (
    <div className=" min-h-screen bg-black  ">
      <Navbar />
      <main>
        <Hero />
        <About />
        <Skills />
        <Projects />
        <Services />
        <Testimonials />
        <Contact />
      </main>
      <Footer />
    </div>
  );
}

export default App;
